Autodesk.Revit.DB.Structure.FabricWireType.CreateDefaultFabricWireType(Autodesk.Revit.DB.Document)
Creates a new FabricWireType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.FabricWireType.BendDiameter
Determines the bending diameter of the wire.
The value should be positive.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for bendDiameter is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The bending diameter bendDiameter is negative.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.FabricWireType.WireDiameter
Determines the diameter of the wire.
The value should be positive and less than 12 inches/300 mm.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for wireDiameter is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The wire diameter wireDiameter is negative or greater than 12 inches/300 mm.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricWireType
A Fabric Wire Type object that is used in the generation of Fabric Wire.
Since:
2013